InformationRegisters/АР_СобственникиОбъектовАрендыСпр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СобственникиОбъектовАрендыСпр</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АгентскаяСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСобственника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/С_СистемаНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>С_СистемаНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УСНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСНО_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНО_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНО_7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНО_20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаКонтрагентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтФакторинговойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажиИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаРаботником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносВУставныйКапитал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДокументРасчетовСКонтрагентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДокументРасчетовСКонтрагентом</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКомитентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/С_ОбщегоНазначенияСервер/Ext/Module.bsl
Функция ПолучитьРеквизитСКлиента(Объект, Реквизит) Экспорт
	
	Возврат Объект[Реквизит];
	
КонецФункции

Функция ПолучитьСтруктуруРаспределенияНДСПоДоговору(ДоговорАренды, Дата) Экспорт
	
	Если ДоговорАренды.ОбъектыАренды.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды
		|ПОМЕСТИТЬ ДействПомПоДоговору
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ПО АР17_ЗаключениеДоговораАренды.Ссылка = АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка
		|ГДЕ
		|	АР17_ЗаключениеДоговораАренды.Ссылка = &Ссылка
		|	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &Дата
		|	И ВЫБОР
		|			КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &Дата
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Контрагент КАК Контрагент,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ СрезСобствВсе
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(
		|			&Дата,
		|			ОбъектАренды В
		|				(ВЫБРАТЬ
		|					ВТ.ОбъектАренды
		|				ИЗ
		|					ДействПомПоДоговору КАК ВТ)) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобствВсе.ОбъектАренды КАК ОбъектАренды,
		|	МАКСИМУМ(СрезСобствВсе.Период) КАК Период
		|ПОМЕСТИТЬ СрезСобствМакс
		|ИЗ
		|	СрезСобствВсе КАК СрезСобствВсе
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезСобствВсе.ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобствВсе.ОбъектАренды КАК ОбъектАренды,
		|	СрезСобствВсе.Контрагент КАК Контрагент,
		|	СрезСобствВсе.ОбъектАренды.ЗначениеХарактеристики * (СрезСобствВсе.ДоляСобственника / 100) КАК Доля
		|ПОМЕСТИТЬ ДолиКА
		|ИЗ
		|	СрезСобствВсе КАК СрезСобствВсе
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезСобствМакс КАК СрезСобствМакс
		|		ПО СрезСобствВсе.ОбъектАренды = СрезСобствМакс.ОбъектАренды
		|			И СрезСобствВсе.Период = СрезСобствМакс.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	С_НалогообложениеКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		|	С_НалогообложениеКонтрагентовСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
		|ПОМЕСТИТЬ НОКА
		|ИЗ
		|	РегистрСведений.С_НалогообложениеКонтрагентов.СрезПоследних(
		|			&Дата,
		|			Контрагент В
		|				(ВЫБРАТЬ
		|					ВТ.Контрагент
		|				ИЗ
		|					ДолиКА КАК ВТ)) КАК С_НалогообложениеКонтрагентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НОКА.Контрагент КАК Контрагент,
		|	НОКА.СистемаНалогообложения КАК СистемаНалогообложения
		|ИЗ
		|	НОКА КАК НОКА
		|ГДЕ
		|	НОКА.СистемаНалогообложения ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ДолиКА.Доля) КАК Доля,
		|	НОКА.СистемаНалогообложения КАК СистемаНалогообложения
		|ИЗ
		|	ДолиКА КАК ДолиКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ НОКА КАК НОКА
		|		ПО ДолиКА.Контрагент = НОКА.Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	НОКА.СистемаНалогообложения";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ссылка", ДоговорАренды);
		
		ИндВыб = 6;
		ИндОш = 5;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Контрагент КАК Контрагент,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТСрезИндСобств
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&Период, ОбъектАренды В ИЕРАРХИИ (&ИК)) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
		|ГДЕ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды.МОП > 0
		|	И АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды.ТипОбъекта = &Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСрезИндСобств.ОбъектАренды КАК ОбъектАренды,
		|	МАКСИМУМ(ВТСрезИндСобств.Период) КАК Период
		|ПОМЕСТИТЬ СрезИндСобствМакс
		|ИЗ
		|	ВТСрезИндСобств КАК ВТСрезИндСобств
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСрезИндСобств.ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСрезИндСобств.ОбъектАренды КАК ОбъектАренды,
		|	ВТСрезИндСобств.Контрагент КАК Контрагент,
		|	ВТСрезИндСобств.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВТСрезИндСобств.ОбъектАренды.МОП * (ВТСрезИндСобств.ДоляСобственника / 100) КАК Доля
		|ПОМЕСТИТЬ ДолиКА
		|ИЗ
		|	ВТСрезИндСобств КАК ВТСрезИндСобств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезИндСобствМакс КАК СрезИндСобствМакс
		|		ПО ВТСрезИндСобств.ОбъектАренды = СрезИндСобствМакс.ОбъектАренды
		|			И ВТСрезИндСобств.Период = СрезИндСобствМакс.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолиКА.Доля КАК Доля,
		|	С_НалогообложениеКонтрагентовСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
		|	ДолиКА.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ НОКА
		|ИЗ
		|	ДолиКА КАК ДолиКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.С_НалогообложениеКонтрагентов.СрезПоследних(
		|				&Период,
		|				Контрагент В
		|					(ВЫБРАТЬ
		|						ВТ.Контрагент
		|					ИЗ
		|						ДолиКА КАК ВТ)) КАК С_НалогообложениеКонтрагентовСрезПоследних
		|		ПО ДолиКА.Контрагент = С_НалогообложениеКонтрагентовСрезПоследних.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НОКА.Контрагент КАК Контрагент
		|ИЗ
		|	НОКА КАК НОКА
		|ГДЕ
		|	НОКА.СистемаНалогообложения ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	НОКА.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НОКА.СистемаНалогообложения КАК СистемаНалогообложения,
		|	СУММА(НОКА.Доля) КАК Доля
		|ИЗ
		|	НОКА КАК НОКА
		|
		|СГРУППИРОВАТЬ ПО
		|	НОКА.СистемаНалогообложения";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("ИК", ДоговорАренды.ИК);
		Запрос.УстановитьПараметр("Помещение", Справочники.АР_ТипыОбъектовАренды.Помещение);

		ИндВыб = 5;
		ИндОш = 4;
		
	КонецЕсли;
	
	РЗП = Запрос.ВыполнитьПакет();
	
	РЗ = РЗП[ИндВыб].Выбрать();
	
	АбсОСНО = 0;
	АбсУСНО = 0;
	
	Пока РЗ.Следующий() Цикл
		
		Если РЗ.СистемаНалогообложения = Перечисления.С_СистемаНалогообложения.ОСНО Тогда
			АбсОСНО = РЗ.Доля;
		ИначеЕсли РЗ.СистемаНалогообложения = Перечисления.С_СистемаНалогообложения.УСНО Тогда
			АбсУСНО = РЗ.Доля;
		Иначе
			
			РЗБНО = РЗП[ИндОш].Выбрать();
			
			Ошибка = "Внимание! Для собственников помещений договора " + Строка(ДоговорАренды) + " не указана система налогообложения!" + Символы.ПС;
			
			Пока РЗБНО.Следующий() Цикл
				Ошибка = Ошибка + "Для контрагента " + Строка(РЗБНО.Контрагент) + " не указана система налогообложения!" + Символы.ПС;
			КонецЦикла;
			
			Сообщить(Ошибка);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если (АбсОСНО+АбсУСНО) <> 0 Тогда
		
		СтруктДолей = Новый Структура;
		СтруктДолей.Вставить("ДоляОСНО", АбсОСНО/(АбсОСНО+АбсУСНО));
		СтруктДолей.Вставить("ДоляУСНО", АбсУСНО/(АбсОСНО+АбсУСНО));
		
		Возврат СтруктДолей;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСистемуНалогобложенияКА(КА, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_НалогообложениеКонтрагентовСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
		|ИЗ
		|	РегистрСведений.С_НалогообложениеКонтрагентов.СрезПоследних(&Период, Контрагент = &КА) КАК С_НалогообложениеКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("КА", КА);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.СистемаНалогообложения;
	КонецЕсли;
		
КонецФункции

Функция ПрименяетсяНачислениеПоОплате(Договор=Неопределено, Контрагент=Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАР,
		|	АР17_ЗаключениеДоговораАренды.ИК КАК ИК
		|ПОМЕСТИТЬ ВТДоговорАР
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|ГДЕ
		|	&УсловиеНаПроверку
		|	И АР17_ЗаключениеДоговораАренды.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате КАК ПрименяетсяУчетДоходаСобственникаПоОплате
		|ИЗ
		|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоговорАР КАК ВТДоговорАР
		|		ПО АР17_УстановкаПараметровИК.ИКСсылка = ВТДоговорАР.ИК
		|ГДЕ
		|	АР17_УстановкаПараметровИК.Проведен
		|	И АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате";	
	
	Если Договор <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаПроверку", "АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента");
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	ИначеЕсли Контрагент <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаПроверку", "АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДоговорАР(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАР
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И АР17_ЗаключениеДоговораАренды.Проведен";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.ДоговорАР;
	КонецЕсли;
	
КонецФункции

Процедура С_ОтражениеДоходаСобственникаПоОплатеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если ПрименяетсяНачислениеПоОплате(Источник.ДоговорКонтрагента) Тогда
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
		
		Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя 
			И ПрименяетсяНачислениеПоОплате(, Источник.Контрагент) Тогда
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		Если ТипЗнч(Источник.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И ПрименяетсяНачислениеПоОплате(Источник.ДокументРеализации.ДоговорКонтрагента) Тогда
			СформироватьДвиженияСторноНачисленияДоходаПоОплатеОтКорРТУ(Источник, Отказ);
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияСторноНачисленияДоходаПоОплатеОтКорРТУ(Источник, Отказ)
	
	Источник.Движения.Хозрасчетный.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаЗачета,
		|	ХозрасчетныйОборотыДтКт.СуммаНУОборотКт КАК СуммаЗачетаНУ,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Справочник.Контрагенты) КАК Контрагент,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ
		|ПОМЕСТИТЬ ЗачетыПоДокументу
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаН, &ДатаК, Регистратор, СчетДт = &Счет7609, , СчетКт = &Счет7609, , СубконтоКт3 ССЫЛКА Документ.КорректировкаРеализации) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_УстановкаПараметровИК.ИКСсылка КАК ИК
		|ПОМЕСТИТЬ ИКДоходПоОплате
		|ИЗ
		|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		|ГДЕ
		|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате
		|	И АР17_УстановкаПараметровИК.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗачетыПоДокументу.СуммаЗачета КАК СуммаЗачета,
		|	ЗачетыПоДокументу.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
		|	ЗачетыПоДокументу.Контрагент КАК Контрагент,
		|	ЗачетыПоДокументу.Договор КАК Договор,
		|	ЗачетыПоДокументу.РТУ КАК РТУ
		|ПОМЕСТИТЬ ЗачетыФильтрНаПрименениеДоходовПоОплате
		|ИЗ
		|	ЗачетыПоДокументу КАК ЗачетыПоДокументу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИКДоходПоОплате КАК ИКДоходПоОплате
		|			ПО АР17_ЗаключениеДоговораАренды.ИК = ИКДоходПоОплате.ИК
		|		ПО ЗачетыПоДокументу.Договор = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Справочник.Контрагенты) КАК КонтрагентСобств,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорСобств,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
		|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
		|	ХозрасчетныйОборотыДтКт.ПодразделениеДт КАК Подразделение,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК НачисленоПр,
		|	ХозрасчетныйОборотыДтКт.СуммаНУОборотДт КАК НачисленоПрНУ
		|ПОМЕСТИТЬ ОборотыНачислениеДохода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			,
		|			&МоментРегистратора,
		|			,
		|			СчетДт = &Счет76Б,
		|			,
		|			СчетКт = &Счет7606,
		|			,
		|			ВЫРАЗИТЬ(СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) В
		|				(ВЫБРАТЬ
		|					ВТ.РТУ КАК РТУ
		|				ИЗ
		|					ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ВТ)) КАК ХозрасчетныйОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыНачислениеДохода.РТУ КАК РТУ,
		|	СУММА(ОборотыНачислениеДохода.НачисленоПр) КАК НачисленоПр,
		|	СУММА(ОборотыНачислениеДохода.НачисленоПрНУ) КАК НачисленоПрНУ
		|ПОМЕСТИТЬ ИтогиОбНачисленоПр
		|ИЗ
		|	ОборотыНачислениеДохода КАК ОборотыНачислениеДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	ОборотыНачислениеДохода.РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыНачислениеДохода.КонтрагентСобств КАК КонтрагентСобств,
		|	ОборотыНачислениеДохода.ДоговорСобств КАК ДоговорСобств,
		|	ОборотыНачислениеДохода.РТУ КАК РТУ,
		|	ОборотыНачислениеДохода.Организация КАК Организация,
		|	ОборотыНачислениеДохода.Подразделение КАК Подразделение,
		|	ОборотыНачислениеДохода.НачисленоПр / ИтогиОбНачисленоПр.НачисленоПр КАК Доля,
		|	ОборотыНачислениеДохода.НачисленоПрНУ / ИтогиОбНачисленоПр.НачисленоПрНУ КАК ДоляНУ
		|ПОМЕСТИТЬ Доли
		|ИЗ
		|	ОборотыНачислениеДохода КАК ОборотыНачислениеДохода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиОбНачисленоПр КАК ИтогиОбНачисленоПр
		|		ПО ОборотыНачислениеДохода.РТУ = ИтогиОбНачисленоПр.РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.СуммаЗачета * Доли.Доля КАК СуммаСторно,
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.СуммаЗачетаНУ * Доли.ДоляНУ КАК СуммаСторноНУ,
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ КАК РТУ,
		|	Доли.КонтрагентСобств КАК КонтрагентСобств,
		|	Доли.ДоговорСобств КАК ДоговорСобств,
		|	Доли.Организация КАК Организация,
		|	Доли.Подразделение КАК Подразделение
		|ИЗ
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ЗачетыФильтрНаПрименениеДоходовПоОплате
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Доли КАК Доли
		|		ПО ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ = Доли.РТУ";
	
	Запрос.УстановитьПараметр("ДатаК", Источник.Дата);
	Запрос.УстановитьПараметр("ДатаН", Источник.Дата);
	Запрос.УстановитьПараметр("МоментРегистратора", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	Запрос.УстановитьПараметр("Счет7609", ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Запрос.УстановитьПараметр("Счет76Б", ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников);
	Запрос.УстановитьПараметр("Счет7606", ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);

	РЗ = Запрос.Выполнить().Выбрать();

	Пока РЗ.Следующий() Цикл
		
		Проводка = Источник.Движения.Хозрасчетный.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период = Источник.Дата;
		Проводка.Организация = РЗ.Организация;
		Проводка.ПодразделениеДт = РЗ.Подразделение;
		Проводка.ПодразделениеКт = РЗ.Подразделение;
		Проводка.Регистратор = Источник.Ссылка;
		
		Проводка.Содержание = "Сторно начисления дохода собственнику при зачете оплаты арендатора";
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.Сумма = (-1) * РЗ.СуммаСторно;
		Проводка.СуммаНУДт = (-1) * РЗ.СуммаСторноНУ;
		Проводка.СуммаНУКт = (-1) * РЗ.СуммаСторноНУ;
		
	КонецЦикла;
	
	Источник.Движения.Хозрасчетный.Записать();

	
КонецПроцедуры


Процедура СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ)
	
	Источник.Движения.Хозрасчетный.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаЗачета,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаЗачетаНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
	|	ХозрасчетныйОбороты.КорСубконто3 КАК КорСубконто3
	|ПОМЕСТИТЬ ЗачетыПрямойПринц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, &ДатаК, Регистратор, Счет = &Счет7609, , , КорСчет = &Счет7609, ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Регистратор = &Регистратор
	|	И ХозрасчетныйОбороты.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ХозрасчетныйОбороты.СуммаОборотКт > 0
	|	И (ХозрасчетныйОбороты.КорСубконто3 ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ИЛИ ХозрасчетныйОбороты.КорСубконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыПрямойПринц.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыПрямойПринц.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыПрямойПринц.Контрагент КАК Контрагент,
	|	ЗачетыПрямойПринц.Договор КАК Договор,
	|	ЗачетыПрямойПринц.РТУ КАК РТУ,
	|	ЗачетыПрямойПринц.КорСубконто3 КАК КорСубконто3,
	|	СчетФактураВыданный.Комитент КАК Комитент,
	|	СчетФактураВыданный.ДоговорКомитента КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетППОпредПр
	|ИЗ
	|	ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (ЗачетыПрямойПринц.КорСубконто3 = СчетФактураВыданный.ДокументОснование)
	|			И (НЕ СчетФактураВыданный.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетыПрямойПринц.СуммаЗачета,
	|	ЗачетыПрямойПринц.СуммаЗачетаНУ,
	|	ЗачетыПрямойПринц.Контрагент,
	|	ЗачетыПрямойПринц.Договор,
	|	ЗачетыПрямойПринц.РТУ,
	|	ЗачетыПрямойПринц.КорСубконто3,
	|	С_УстановкаПринципалаНаАванс.Комитент,
	|	С_УстановкаПринципалаНаАванс.ДоговорКомитента
	|ИЗ
	|	ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.С_УстановкаПринципалаНаАванс КАК С_УстановкаПринципалаНаАванс
	|		ПО ((ВЫРАЗИТЬ(ЗачетыПрямойПринц.КорСубконто3 КАК Документ.ДокументРасчетовСКонтрагентом)) = С_УстановкаПринципалаНаАванс.Основание)
	|			И (НЕ С_УстановкаПринципалаНаАванс.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаЗачета,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборотКт КАК СуммаЗачетаНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ОстатокАрендатора,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокДт КАК ОстатокАрендатораНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ
	|ПОМЕСТИТЬ ЗачетыПоДокументу
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаН, &ДатаК, Регистратор, , Счет = &Счет7609, , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор = &Регистратор
	|	И ХозрасчетныйОстаткиИОбороты.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ХозрасчетныйОстаткиИОбороты.СуммаОборотКт > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыПоДокументу.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыПоДокументу.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыПоДокументу.Контрагент КАК Контрагент,
	|	ЗачетыПоДокументу.ОстатокАрендатора КАК ОстатокАрендатора,
	|	ЗачетыПоДокументу.ОстатокАрендатораНУ КАК ОстатокАрендатораНУ,
	|	ЗачетыПоДокументу.Договор КАК Договор,
	|	ЗачетыПоДокументу.РТУ КАК РТУ,
	|	NULL КАК КорСубконто3,
	|	NULL КАК Комитент,
	|	NULL КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетыИтог
	|ИЗ
	|	ЗачетыПоДокументу КАК ЗачетыПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ПО ЗачетыПоДокументу.РТУ = ЗачетыПрямойПринц.РТУ
	|ГДЕ
	|	ЗачетыПрямойПринц.Контрагент ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетППОпредПр.СуммаЗачета,
	|	ЗачетППОпредПр.СуммаЗачетаНУ,
	|	ЗачетППОпредПр.Контрагент,
	|	NULL,
	|	NULL,
	|	ЗачетППОпредПр.Договор,
	|	ЗачетППОпредПр.РТУ,
	|	ЗачетППОпредПр.КорСубконто3,
	|	ЗачетППОпредПр.Комитент,
	|	ЗачетППОпредПр.ДоговорКомитента
	|ИЗ
	|	ЗачетППОпредПр КАК ЗачетППОпредПр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_УстановкаПараметровИК.ИКСсылка КАК ИК
	|ПОМЕСТИТЬ ИКДоходПоОплате
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
	|ГДЕ
	|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате
	|	И АР17_УстановкаПараметровИК.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыИтог.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыИтог.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыИтог.Контрагент КАК Контрагент,
	|	ЗачетыИтог.ОстатокАрендатора КАК ОстатокАрендатора,
	|	ЗачетыИтог.ОстатокАрендатораНУ КАК ОстатокАрендатораНУ,
	|	ЗачетыИтог.Договор КАК Договор,
	|	ЗачетыИтог.РТУ КАК РТУ,
	|	ЗачетыИтог.СуммаЗачета / (ЗачетыИтог.СуммаЗачета + ЕСТЬNULL(ЗачетыИтог.ОстатокАрендатора, 0)) КАК ДоляОплаты,
	|	ЗачетыИтог.СуммаЗачетаНУ / (ЗачетыИтог.СуммаЗачетаНУ + ЕСТЬNULL(ЗачетыИтог.ОстатокАрендатораНУ, 0)) КАК ДоляОплатыНУ,
	|	ЗачетыИтог.КорСубконто3 КАК КорСубконто3,
	|	ЗачетыИтог.Комитент КАК Комитент,
	|	ЗачетыИтог.ДоговорКомитента КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетыФильтрНаПрименениеДоходовПоОплате
	|ИЗ
	|	ЗачетыИтог КАК ЗачетыИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИКДоходПоОплате КАК ИКДоходПоОплате
	|			ПО АР17_ЗаключениеДоговораАренды.ИК = ИКДоходПоОплате.ИК
	|		ПО ЗачетыИтог.Договор = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокСобств,
	|	ХозрасчетныйОстатки.СуммаНУОстатокКт КАК ОстатокСобствНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК КонтрагентСобств,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорСобств,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ОстаткиПоСобств
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&МоментРегистратора,
	|			Счет = &Счет76Б,
	|			,
	|			ВЫРАЗИТЬ(Субконто3 КАК Документ.РеализацияТоваровУслуг) В
	|				(ВЫБРАТЬ
	|					ВТ.РТУ КАК РТУ
	|				ИЗ
	|					ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ВТ)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСобств.КонтрагентСобств КАК КонтрагентСобств,
	|	ОстаткиПоСобств.ДоговорСобств КАК ДоговорСобств,
	|	ОстаткиПоСобств.РТУ КАК РТУ,
	|	ОстаткиПоСобств.ОстатокСобств * ЗачетыФильтрНаПрименениеДоходовПоОплате.ДоляОплаты КАК Сумма,
	|	ОстаткиПоСобств.ОстатокСобствНУ * ЗачетыФильтрНаПрименениеДоходовПоОплате.ДоляОплатыНУ КАК СуммаНУ,
	|	ОстаткиПоСобств.Организация КАК Организация,
	|	ОстаткиПоСобств.Подразделение КАК Подразделение
	|ИЗ
	|	ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ЗачетыФильтрНаПрименениеДоходовПоОплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСобств КАК ОстаткиПоСобств
	|		ПО ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ = ОстаткиПоСобств.РТУ
	|ГДЕ
	|	ЗачетыФильтрНаПрименениеДоходовПоОплате.КорСубконто3 ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетыИтог.Комитент,
	|	ЗачетыИтог.ДоговорКомитента,
	|	ЗачетыИтог.РТУ,
	|	ЗачетыИтог.СуммаЗачета,
	|	ЗачетыИтог.СуммаЗачетаНУ,
	|	ЗачетыИтог.РТУ.Организация,
	|	ЗачетыИтог.РТУ.ПодразделениеОрганизации
	|ИЗ
	|	ЗачетыИтог КАК ЗачетыИтог
	|ГДЕ
	|	НЕ ЗачетыИтог.КорСубконто3 ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаК", Источник.Дата);
	Запрос.УстановитьПараметр("ДатаН", Источник.Дата);
	Запрос.УстановитьПараметр("МоментРегистратора", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	Запрос.УстановитьПараметр("Счет7609", ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Запрос.УстановитьПараметр("Счет76Б", ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников);

	РЗ = Запрос.Выполнить().Выбрать();

	Пока РЗ.Следующий() Цикл
		
		Проводка = Источник.Движения.Хозрасчетный.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период = Источник.Дата;
		Проводка.Организация = РЗ.Организация;
		Проводка.ПодразделениеДт = РЗ.Подразделение;
		Проводка.ПодразделениеКт = РЗ.Подразделение;
		Проводка.Регистратор = Источник.Ссылка;
		
		Проводка.Содержание = "Начисление дохода собственнику при зачете оплаты арендатора";
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.Сумма = РЗ.Сумма;
		Проводка.СуммаНУДт = РЗ.СуммаНУ;
		Проводка.СуммаНУКт = РЗ.СуммаНУ;
		
	КонецЦикла;
	
	Источник.Движения.Хозрасчетный.Записать();
	
КонецПроцедуры

Процедура С_ОтражениеДоходовСобственниковЗачетОППриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияБух") Тогда
		
		ТЗДВ = Источник.Движения.Хозрасчетный.Выгрузить();
		
		Стр7609 = ТЗДВ.Найти(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами, "СчетКт");
		Если Стр7609 = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Стр76Б = ТЗДВ.Найти(ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников, "СчетДт");
		Если Стр76Б <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДолюПринципалаВМОП(ИК, Принципал, ДоговорПринципала, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Контрагент КАК Контрагент,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ СрезСобственности
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&Период, ОбъектАренды В ИЕРАРХИИ (&ИК)) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобственности.ОбъектАренды КАК ОбъектАренды,
		|	МАКСИМУМ(СрезСобственности.Период) КАК Период
		|ПОМЕСТИТЬ СрезМакс
		|ИЗ
		|	СрезСобственности КАК СрезСобственности
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезСобственности.ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобственности.ОбъектАренды КАК ОбъектАренды,
		|	СрезСобственности.Контрагент КАК Контрагент,
		|	СрезСобственности.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СрезСобственности.ОбъектАренды.АП * (СрезСобственности.ДоляСобственника / 100) КАК ПлощадьСобственника,
		|	СрезСобственности.Период КАК Период
		|ПОМЕСТИТЬ СрезПлощадей
		|ИЗ
		|	СрезСобственности КАК СрезСобственности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезМакс КАК СрезМакс
		|		ПО СрезСобственности.ОбъектАренды = СрезМакс.ОбъектАренды
		|			И СрезСобственности.Период = СрезМакс.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(СрезПлощадей.ПлощадьСобственника) КАК ОбщаяПлощадь
		|ПОМЕСТИТЬ ВТОбщаяПлощадь
		|ИЗ
		|	СрезПлощадей КАК СрезПлощадей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезПлощадей.Контрагент КАК Принципал,
		|	СрезПлощадей.ДоговорКонтрагента КАК ДоговорПринципала,
		|	СУММА(СрезПлощадей.ПлощадьСобственника) КАК ПлощадьСобственника
		|ПОМЕСТИТЬ ПлощадьИскомого
		|ИЗ
		|	СрезПлощадей КАК СрезПлощадей
		|ГДЕ
		|	СрезПлощадей.Контрагент = &Принципал
		|	И СрезПлощадей.ДоговорКонтрагента = &ДоговорПринципала
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезПлощадей.Контрагент,
		|	СрезПлощадей.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлощадьИскомого.Принципал КАК Принципал,
		|	ПлощадьИскомого.ДоговорПринципала КАК ДоговорПринципала,
		|	ПлощадьИскомого.ПлощадьСобственника / ВТОбщаяПлощадь.ОбщаяПлощадь * 100 КАК ДоляПринципалаВМОП
		|ИЗ
		|	ПлощадьИскомого КАК ПлощадьИскомого,
		|	ВТОбщаяПлощадь КАК ВТОбщаяПлощадь";
	
	Запрос.УстановитьПараметр("ИК", ИК);
	Запрос.УстановитьПараметр("Принципал", Принципал);
	Запрос.УстановитьПараметр("ДоговорПринципала", ДоговорПринципала);
	Запрос.УстановитьПараметр("Период", Период);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.ДоляПринципалаВМОП;		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДолюПринципалаВМОПОтПлощадейМОП(ИК, Принципал, ДоговорПринципала, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Контрагент КАК Контрагент,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ СрезСобственности
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&Период, ОбъектАренды В ИЕРАРХИИ (&ИК)) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобственности.ОбъектАренды КАК ОбъектАренды,
		|	МАКСИМУМ(СрезСобственности.Период) КАК Период
		|ПОМЕСТИТЬ СрезМакс
		|ИЗ
		|	СрезСобственности КАК СрезСобственности
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезСобственности.ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезСобственности.ОбъектАренды КАК ОбъектАренды,
		|	СрезСобственности.Контрагент КАК Контрагент,
		|	СрезСобственности.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СрезСобственности.ОбъектАренды.МОП * (СрезСобственности.ДоляСобственника / 100) КАК ПлощадьСобственника,
		|	СрезСобственности.Период КАК Период
		|ПОМЕСТИТЬ СрезПлощадей
		|ИЗ
		|	СрезСобственности КАК СрезСобственности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезМакс КАК СрезМакс
		|		ПО СрезСобственности.ОбъектАренды = СрезМакс.ОбъектАренды
		|			И СрезСобственности.Период = СрезМакс.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(СрезПлощадей.ПлощадьСобственника) КАК ОбщаяПлощадь
		|ПОМЕСТИТЬ ВТОбщаяПлощадь
		|ИЗ
		|	СрезПлощадей КАК СрезПлощадей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезПлощадей.Контрагент КАК Принципал,
		|	СрезПлощадей.ДоговорКонтрагента КАК ДоговорПринципала,
		|	СУММА(СрезПлощадей.ПлощадьСобственника) КАК ПлощадьСобственника
		|ПОМЕСТИТЬ ПлощадьИскомого
		|ИЗ
		|	СрезПлощадей КАК СрезПлощадей
		|ГДЕ
		|	СрезПлощадей.Контрагент = &Принципал
		|	И СрезПлощадей.ДоговорКонтрагента = &ДоговорПринципала
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезПлощадей.Контрагент,
		|	СрезПлощадей.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлощадьИскомого.Принципал КАК Принципал,
		|	ПлощадьИскомого.ДоговорПринципала КАК ДоговорПринципала,
		|	ПлощадьИскомого.ПлощадьСобственника / ВТОбщаяПлощадь.ОбщаяПлощадь * 100 КАК ДоляПринципалаВМОП
		|ИЗ
		|	ПлощадьИскомого КАК ПлощадьИскомого,
		|	ВТОбщаяПлощадь КАК ВТОбщаяПлощадь";
	
	Запрос.УстановитьПараметр("ИК", ИК);
	Запрос.УстановитьПараметр("Принципал", Принципал);
	Запрос.УстановитьПараметр("ДоговорПринципала", ДоговорПринципала);
	Запрос.УстановитьПараметр("Период", Период);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.ДоляПринципалаВМОП;		
	КонецЕсли;
	
КонецФункции


Функция ПолучитьПредставлениеПодписантаДляОтчетаАгента(ИК, НаДату, Сторона, Договор=Неопределено, ПредставлениеШапки = Истина) Экспорт
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ДоговорОтбор = Договор;
	Иначе
		ДоговорОтбор = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	С_НастройкаПодписантовОтчетАгентаСрезПоследних.ПредставлениеШапкаОтчета КАК ПредставлениеШапкаОтчета,
	|	С_НастройкаПодписантовОтчетАгентаСрезПоследних.ПредставлениеПодвалОтчета КАК ПредставлениеПодвалОтчета,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.С_НастройкаПодписантовОтчетАгента.СрезПоследних(
	|			&Период,
	|			ИК = &ИК
	|				И Сторона = &Сторона
	|				И ВЫБОР
	|					КОГДА &Договор <> НЕОПРЕДЕЛЕНО
	|						ТОГДА Договор = &Договор
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК С_НастройкаПодписантовОтчетАгентаСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	С_НастройкаПодписантовОтчетАгентаСрезПоследних.ПредставлениеШапкаОтчета,
	|	С_НастройкаПодписантовОтчетАгентаСрезПоследних.ПредставлениеПодвалОтчета,
	|	2
	|ИЗ
	|	РегистрСведений.С_НастройкаПодписантовОтчетАгента.СрезПоследних(
	|			&Период,
	|			ИК = &ИК
	|				И Сторона = &Сторона
	|				И Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК С_НастройкаПодписантовОтчетАгентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.ПредставлениеШапкаОтчета КАК ПредставлениеШапкаОтчета,
	|	ВТ.ПредставлениеПодвалОтчета КАК ПредставлениеПодвалОтчета,
	|	ВТ.Порядок КАК Порядок
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("ИК", ИК);
	Запрос.УстановитьПараметр("Период", НаДату);
	Запрос.УстановитьПараметр("Сторона", Сторона);
	Запрос.УстановитьПараметр("Договор", ДоговорОтбор);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Представление = "";
	
	Если РЗ.Следующий() Тогда
		Если ПредставлениеШапки Тогда
			Представление = РЗ.ПредставлениеШапкаОтчета;
		Иначе
			Представление = РЗ.ПредставлениеПодвалОтчета; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции

Функция С_ПолучитьТекстЗапросаОбъектовАрендыПоДоговоруАР() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Собственник КАК Собственник,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорСобственника КАК ДоговорСобственника,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи КАК ДатаПередачи,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата КАК ДатаВозврата
	|ПОМЕСТИТЬ ОбъектыПоДоговоруВсе
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка = &ДоговорАР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыПоДоговоруВсе.ОбъектАренды КАК ОбъектАренды,
	|	ОбъектыПоДоговоруВсе.Собственник КАК Собственник,
	|	ОбъектыПоДоговоруВсе.ДоговорСобственника КАК ДоговорСобственника,
	|	ОбъектыПоДоговоруВсе.ДатаПередачи КАК ДатаПередачи,
	|	ОбъектыПоДоговоруВсе.ДатаВозврата КАК ДатаВозврата
	|ПОМЕСТИТЬ ОбъектыАренды
	|ИЗ
	|	ОбъектыПоДоговоруВсе КАК ОбъектыПоДоговоруВсе
	|ГДЕ
	|	ОбъектыПоДоговоруВсе.ДатаПередачи <= &ДатаК
	|	И ВЫБОР
	|			КОГДА ОбъектыПоДоговоруВсе.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОбъектыПоДоговоруВсе.ДатаВозврата >= &ДатаН
	|		КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция С_ПолучитьТекстЗапросаОбъектовАрендыПоИК() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_ОбъектыАренды.Ссылка КАК ОбъектАренды
	|ПОМЕСТИТЬ ОбъектыАрендыИК
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	АР_ОбъектыАренды.ТипОбъекта = &Помещение
	|	И АР_ОбъектыАренды.МОП > 0
	|	И АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Собственник КАК Собственник,
	|	АР17_ЗаключениеДоговораАренды.ДоговорСобственника КАК ДоговорСобственника
	|ПОМЕСТИТЬ ДоговорАР
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.Ссылка = &ДоговорАР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАрендыИК.ОбъектАренды КАК ОбъектАренды,
	|	ДоговорАР.Собственник КАК Собственник,
	|	ДоговорАР.ДоговорСобственника КАК ДоговорСобственника
	|ПОМЕСТИТЬ ОбъектыАренды
	|ИЗ
	|	ОбъектыАрендыИК КАК ОбъектыАрендыИК,
	|	ДоговорАР КАК ДоговорАР";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСомСоединениеТСЖ() Экспорт
	
	Сервер = "srv-1C2";
	ИмяИБ = "vertical"; 
	Логин = "Рязанова Татьяна";
	Пароль = "";
	
	//Сервер = "HV-01";
	//ИмяИБ = "test2"; 
	//Логин = "Рязанова Татьяна";
	//Пароль = "";
	
	Попытка
		
		COMConnector = Новый COMОбъект("V83.COMConnector");
		
		мИБ = COMConnector.Connect("Srvr=""" + Сервер + """;
		|Ref=""" + ИмяИБ + """;
		|Usr='" + Логин + "';
		|Pwd='" + Пароль + "';");
		
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное)	
	КонецПопытки;
	
	Возврат мИБ;	
	
КонецФункции

Функция ПолучитьКэшУслугТСЖ() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("УслугаТСЖ_Лок");
	ТЗ.Колонки.Добавить("УслугаТСЖ_Сом");
	
	Возврат ТЗ;
	
КонецФункции
